In [1]:
import pandas as pd

Question 1:

In [2]:
data = {
    'TID':['1','2','3','4','5','6','7','8','9','10'],
    'Refund':['Yes','No','No','Yes','No','No','Yes','No','No','No'],
    'Marital Status':['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    'Cheat':['No','No','No','No','Yes','No','No','Yes','No','Yes']}

df = pd.DataFrame(data)
print(df)

  TID Refund Marital Status Cheat
0   1    Yes         Single    No
1   2     No        Married    No
2   3     No         Single    No
3   4    Yes        Married    No
4   5     No       Divorced   Yes
5   6     No        Married    No
6   7    Yes       Divorced    No
7   8     No         Single   Yes
8   9     No        Married    No
9  10     No         Single   Yes

Question 2:

In [3]:
print(df.loc[[0, 4, 7, 8]])

  TID Refund Marital Status Cheat
0   1    Yes         Single    No
4   5     No       Divorced   Yes
7   8     No         Single   Yes
8   9     No        Married    No

Question 3:

In [4]:
# 1
print(df.iloc[3:8])

# 2
print(df.iloc[4:9, 2:5])

# 3
print(df.iloc[:, 1:4])

  TID Refund Marital Status Cheat
3   4    Yes        Married    No
4   5     No       Divorced   Yes
5   6     No        Married    No
6   7    Yes       Divorced    No
7   8     No         Single   Yes
  Marital Status Cheat
4       Divorced   Yes
5        Married    No
6       Divorced    No
7         Single   Yes
8        Married    No
  Refund Marital Status Cheat
0    Yes         Single    No
1     No        Married    No
2     No         Single    No
3    Yes        Married    No
4     No       Divorced   Yes
5     No        Married    No
6    Yes       Divorced    No
7     No         Single   Yes
8     No        Married    No
9     No         Single   Yes

Question 4:

In [5]:
from sklearn.datasets import load_iris

iris = load_iris()
iris_df = pd.DataFrame(data=iris.data, columns=iris.feature_names)
iris_df['target'] = iris.target
print(iris_df.head())

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  \
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

   target
0       0
1       0
2       0
3       0
4       0

Question 5:

In [6]:
iris_modified = iris_df.drop(index=4).drop(iris_df.columns[3], axis=1)
print(iris_modified.head())

   sepal length (cm)  sepal width (cm)  petal length (cm)  target
0                5.1               3.5                1.4       0
1                4.9               3.0                1.4       0
2                4.7               3.2                1.3       0
3                4.6               3.1                1.5       0
5                5.4               3.9                1.7       0

Question 6:

In [7]:
emp_data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Edward'],
    'Department': ['HR', 'IT', 'IT', 'Marketing', 'Sales'],
    'Age': [29, 34, 41, 28, 38],
    'Salary': [50000, 70000, 65000, 55000, 60000],
    'Years_of_Experience': [4, 8, 10, 3, 12],
    'Joining_Date': ['2020-03-15', '2017-07-19', '2013-06-01', '2021-02-10', '2010-11-25'],
    'Gender': ['Female', 'Male', 'Male', 'Female', 'Male'],
    'Bonus': [5000, 7000, 6000, 4500, 5000],
    'Rating': [4.5, 4.0, 3.8, 4.7, 3.5]
}
emp_df = pd.DataFrame(emp_data)
emp_df['Joining_Date'] = pd.to_datetime(emp_df['Joining_Date'])
emp_df.to_csv('employees.csv', index=False)
emp_df.head()



# a)
print(emp_df.shape)

# b)
print(emp_df.info())

# c)
print(emp_df.describe(include='all'))

# d)
print(emp_df.head())
print(emp_df.tail(3))


# e)
print("Average Salary:", emp_df['Salary'].mean())
print("Total Bonus:", emp_df['Bonus'].sum())
print("Youngest Age:", emp_df['Age'].min())
print("Highest Rating:", emp_df['Rating'].max())

# f)
print(emp_df.sort_values(by='Salary', ascending=False))


# g)
def performance_category(rating):
    if rating >= 4.5:
        return "Excellent"
    elif rating >= 4.0:
        return "Good"
    else:
        return "Average"

emp_df['Performance'] = emp_df['Rating'].apply(performance_category)

# h)
print(emp_df.isnull().sum())


# i)
emp_df.rename(columns={'Employee_ID': 'ID'}, inplace=True)

# j)
print(emp_df[emp_df['Years_of_Experience'] > 5])
print(emp_df[emp_df['Department'] == 'IT'])

# k)
emp_df['Tax'] = emp_df['Salary'] * 0.10


# l)
emp_df.to_csv('employees_modified.csv', index=False)

(5, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      datetime64[ns]
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(3)
memory usage: 532.0+ bytes
None
        Employee_ID   Name Department        Age       Salary  \
count      5.000000      5          5   5.000000      5.00000
unique          NaN      5          4        NaN          NaN
top             NaN  Alice         IT        NaN          NaN
freq            NaN      1          2        NaN          NaN
mean     103.000000    NaN        NaN  34.000000  60000.00000
min      101.000000    NaN        NaN  28.000000  50000.00000
25%      102.000000    NaN        NaN  29.000000  55000.00000
50%      103.000000    NaN        NaN  34.000000  60000.00000
75%      104.000000    NaN        NaN  38.000000  65000.00000
max      105.000000    NaN        NaN  41.000000  70000.00000
std        1.581139    NaN        NaN   5.612486   7905.69415

        Years_of_Experience         Joining_Date Gender   Bonus    Rating
count              5.000000                    5      5     5.0  5.000000
unique                  NaN                  NaN      2     NaN       NaN
top                     NaN                  NaN   Male     NaN       NaN
freq                    NaN                  NaN      3     NaN       NaN
mean               7.400000  2016-08-20 00:00:00    NaN  5500.0  4.100000
min                3.000000  2010-11-25 00:00:00    NaN  4500.0  3.500000
25%                4.000000  2013-06-01 00:00:00    NaN  5000.0  3.800000
50%                8.000000  2017-07-19 00:00:00    NaN  5000.0  4.000000
75%               10.000000  2020-03-15 00:00:00    NaN  6000.0  4.500000
max               12.000000  2021-02-10 00:00:00    NaN  7000.0  4.700000
std                3.847077                  NaN    NaN  1000.0  0.494975
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
Average Salary: 60000.0
Total Bonus: 27500
Youngest Age: 28
Highest Rating: 4.7
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5
Employee_ID            0
Name                   0
Department             0
Age                    0
Salary                 0
Years_of_Experience    0
Joining_Date           0
Gender                 0
Bonus                  0
Rating                 0
Performance            0
dtype: int64
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average
4   Male   5000     3.5     Average
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average